<template>
  <div class="mt-16">
    <div class="bgimg">
      <v-container>
        <v-row justify="space-between">
          <v-col cols="12" md="5">
            <h1 class="text-center text-white">
              Гармония с вегетососудистой дистонией
            </h1>
            <v-card-text class="my-5 text-justify text-white">
              <p>
                Вегето-сосудистая дистония может повлиять на качество жизни,
                вызывая различные симптомы, включая головокружение,
                сердцебиение, изменения артериального давления, усталость и
                тревожность. Но есть хорошие новости! Путем скорректированного
                образа жизни и управления факторами, которые влияют на ВСД, вы
                можете улучшить свое состояние и восстановить контроль над своим
                здоровьем.
              </p>
            </v-card-text>
          </v-col>
          <v-col cols="12" md="6">
            <v-card class="py-6 px-6" elevation="10">
              <NotificationsComponents />
            </v-card>
          </v-col>
        </v-row>
      </v-container>
    </div>
    <hr />
    <v-container class="my-8">
      <v-row justify="space-between">
        <v-col cols="12" sm="7"
          ><h2 class="text-center">Что такое вегетососудистая дистония?</h2>
          <v-card-text class="my-5 text-justify">
            <p>
              Вегетососудистая дистония (ВСД) представляет собой нарушение
              тонуса кровеносных сосудов, таких как артерии, вены и капилляры,
              вызванное дисбалансом в работе вегетативной нервной системы.
              Нервная система человека состоит из соматической нервной системы и
              вегетативной нервной системы. ВСД связана с нарушением работы
              вегетативной нервной системы и возникает из-за нарушения баланса
              между ее двумя компонентами - симпатической и парасимпатической
              системами. Симпатическая нервная система регулирует активность
              внутренних органов и активизирует процессы, связанные с
              энергозатратами. Парасимпатическая система, напротив, активизирует
              процессы накопления энергии и веществ в организме. Нарушение
              баланса между этими системами может привести к развитию синдрома
              ВСД.
            </p>
          </v-card-text>
        </v-col>
        <v-col cols="12" sm="4"><v-img src="../assets/img1.jpg"></v-img></v-col>
      </v-row>
      <v-row justify="space-between" class="mt-6">
        <v-col cols="12" sm="4" class="hidden-sm-and-down">
          <v-img src="../assets/img2.jpg"></v-img>
        </v-col>
        <v-col cols="12" sm="7"
          ><h2 class="text-center">Симптомы</h2>
          <v-card-text class="my-5 text-justify">
            <p>
              Вегето-сосудистая дистония – это комплекс синдромов,
              характеризующихся расстройством или поражением вегетативной
              нервной системы. Многие отдельные симптомы зачастую являются
              показателями наличия каких-либо других заболеваний, напрямую не
              связанных с деятельностью вегетативной нервной системы или мозга.
              Однако их объединение на фоне кардиологических или
              сердечно-сосудистых проявлений дает основание диагностировать
              состояние именно как проявление вегето-сосудистой дистонии.
            </p>
            <h3>
              Наиболее характерными проявлениями или симптомами ВСД являются:
            </h3>
            <ul>
              <li>Головные боли</li>
              <li>Головокружения</li>
              <li>Слабость</li>
              <li>Потливость</li>
              <li>Обморочные состояния или обмороки</li>
              <li>Шум в ушах</li>
              <li>Сонливость</li>
              <li>Резкие эмоциональные перепады</li>
              <li>Панические атаки</li>
              <li>Навязчивые синдромы</li>
              <li>Тревожность</li>
              <li>Мнительность</li>
              <li>Повышенная частота сердечного ритма</li>
              <li>Перепады температуры тела.</li>
            </ul>
            <p>
              Еще вегетососудистая дистония характеризуется проявлением
              выраженных болей в области груди и сердца, изменением ритма и
              характера сердечного ритма (вплоть до полной блокады) и другими
              симптомами, связанными с сердечно-сосудистой системой.
            </p>
            <p>
              Другими проявлениями и признаками вегетососудистой дистонии
              являются: метеозависимость, понос или запор, рвота, боли в сердце.
            </p>
          </v-card-text>
          <v-btn
            class="mt-6"
            :ripple="false"
            variant="plain"
            append-icon="mdi-chevron-right"
            color="light-blue-darken-4"
            router
            :to="`/test`"
            >Пройти тест Вейна</v-btn
          ></v-col
        >
        <v-col cols="12" sm="4" class="hidden-md-and-up">
          <v-img src="../assets/img2.jpg"></v-img>
        </v-col>
      </v-row>
      <v-row justify="space-between" class="mt-6">
        <v-col cols="12" sm="7"
          ><h2 class="text-center">Причины</h2>
          <v-card-text class="my-5 text-justify">
            <p>
              Развитие вегетососудистой дистонии у детей младшего возраста может
              быть обусловлено патологией перинатального периода (внутриутробной
              гипоксией плода), родовыми травмами, заболеваниями периода
              новорожденности. Эти факторы отрицательно сказываются на
              сформированности соматической и вегетативной нервной системы,
              полноценности выполняемых ими функций. Вегетативная дисфункция у
              таких детей проявляется пищеварительными нарушениями (частые
              срыгивания, метеоризм, неустойчивый характер стула, плохой
              аппетит), эмоциональным дисбалансом (повышенной конфликтностью,
              капризностью), склонностью к простудным заболеваниям.
            </p>
            <p>
              В период полового созревания развитие внутренних органов и рост
              организма в целом опережает становление нейроэндокринной
              регуляции, что ведет к усугублению вегетативной дисфункции.
            </p>
            <p>
              В этом возрасте вегето-сосудистая дистония проявляется болями в
              области сердца, перебоями и сердцебиением, лабильностью
              артериального давления, психоневрологическими расстройствами
              (повышенной утомляемостью, снижением памяти и внимания,
              вспыльчивостью, высокой тревожностью, раздражительностью).
              Вегето-сосудистая дистония встречается у 12-29% детей и
              подростков.
            </p>
            <p>
              У взрослых пациентов возникновение вегето-сосудистой дистонии
              может провоцироваться и усугубляться в связи с влиянием
              хронических заболеваний, депрессий, стрессов, неврозов,
              черепно-мозговых травм и травм шейного отдела позвоночника,
              эндокринных болезней, патологий ЖКТ, гормональных перестроек
              (беременности, климакса). В любом возрасте фактором риска развития
              вегето-сосудистой дистонии является конституциональная
              наследственность.
            </p>
          </v-card-text>
          <v-btn
            class="mt-6"
            :ripple="false"
            variant="plain"
            append-icon="mdi-chevron-right"
            color="light-blue-darken-4"
            router
            :to="`/about`"
            >Узнать больше про ВСД</v-btn
          ></v-col
        >
        <v-col cols="12" sm="4"><v-img src="../assets/img3.jpg"></v-img></v-col>
      </v-row>
    </v-container>

    <hr />
    <NotificationsInfoComponents />
  </div>
</template>

<script>
import NotificationsComponents from "../components/NotificationsComponents.vue";
import NotificationsInfoComponents from "../components/NotificationsInfoComponents.vue";
export default {
  components: { NotificationsComponents, NotificationsInfoComponents },
};
</script>

<style type="text/css">
.bgimg {
  background-image: url("../assets/bg_home.png");
  background-repeat: repeat;
}
</style>
