<template>
  <div class="mt-16">
    <div class="bgimg">
      <v-container>
        <h1 class="text-center text-white">Результат тестирования</h1>
        <v-card class="py-6 px-6 my-8" elevation="10">
          <v-card-text class="my-5 text-center">
            <p>Не предполагается наличие синдрома вегетативной дистонии.</p>
          </v-card-text>
        </v-card>
      </v-container>
    </div>
    <hr />
    <v-container class="my-8">
      <h2 class="text-center">Что делать?</h2>
      <v-card class="py-6 px-6 my-8" elevation="10">
        <v-card-text class="my-5 text-center">
          <p>
            Если вы чувствуете себя нехорошо необходимо посетить врача в
            ближайшем поликлинике.
          </p>
        </v-card-text>
      </v-card>

      <h3 class="text-center text-body-1">
        Соблюдай профилактические меры для улучшения своего здоровья.
      </h3>
      <v-card class="py-6 px-6 my-8" elevation="10">
        <v-card-text class="my-5 text-justify">
          <ol>
            <li>
              Регулярное физическое упражнение
              <ul class="px-5">
                <li>
                  Упражнения средней интенсивности, такие как ходьба, плавание,
                  йога или танцы, могут быть полезны для укрепления
                  сердечно-сосудистой системы.
                </li>
                <li>
                  Приступайте к физическим нагрузкам постепенно, избегая резких
                  перегрузок.
                </li>
                <li>
                  Регулярные тренировки 20-30 минут в день, 3-5 раз в неделю,
                  могут помочь снизить уровень тревоги и улучшить общую
                  физическую выносливость.
                </li>
              </ul>
            </li>
            <li>
              Правильное дыхание
              <ul class="px-5">
                <li>
                  При ВСД важно обращать внимание на дыхание. Это может помочь
                  снизить симптомы тревоги и головокружения.
                </li>
                <li>
                  Глубокое и медленное дыхание помогает снизить активность
                  симпатической нервной системы и снять напряжение.
                </li>
                <li>
                  Практикуйте диафрагмальное дыхание, при котором вы дышите
                  глубоко, расширяя живот, а не грудную клетку.
                </li>
                <li>
                  При осознанном дыхании задержите вдох на несколько секунд
                  перед плавным выдохом.
                </li>
                <li>
                  Это можно делать несколько раз в день или при возникновении
                  симптомов ВСД.
                </li>
              </ul>
            </li>
            <li>
              Управление стрессом
              <ul class="px-5">
                <li>
                  Стресс может усиливать симптомы ВСД. Попробуйте различные
                  методы расслабления, такие как медитация, глубокая мышечная
                  релаксация, массаж или слушание приятной музыки. Найдите
                  способ снизить стресс, который работает лучше всего для вас.
                </li>
                <li>
                  Найдите свои способы справляться со стрессом, которые работают
                  лучше всего для вас: это может быть чтение, прогулка на
                  природе, слушание музыки или занятие хобби.
                </li>
                <li>
                  Регулярно выделяйте время для себя и отдыха, чтобы
                  восстановить энергию и снизить нагрузку на организм.
                </li>
              </ul>
            </li>
            <li>
              Регулярный сон
              <ul class="px-5">
                <li>
                  Правильный и регулярный сон играет важную роль в общем
                  здоровье и благополучии. Постарайтесь придерживаться
                  регулярного расписания сна, создавайте комфортные условия для
                  сна. Избегайте яркого освещения, шума и излишней активности
                  перед сном.
                </li>
                <li>
                  Рекомендуется не употреблять пищу за 3 часа до сна, чтобы
                  организм имел возможность полноценно отдохнуть, а не
                  заниматься перевариванием пищи.
                </li>
                <li>
                  Избегайте чрезмерного потребления кофеина, который может
                  усиливать симптомы ВСД.
                </li>
                <li>
                  Оптимальная комнатная температура для сна составляет примерно
                  18-20 градусов Цельсия.
                </li>
                <li>
                  Разработайте ритуал перед сном, который поможет вам
                  расслабиться и подготовиться к сну. Это может быть чтение
                  книги, принятие теплой ванны, медитация.
                </li>
              </ul>
            </li>
            <li>
              Правильное питание
              <ul class="px-5">
                <li>
                  Питайтесь здоровой и сбалансированной пищей. Избегайте
                  чрезмерного употребления кофеина, алкоголя и пищи, богатой
                  сахаром. Регулярное питание с небольшими перекусами может
                  помочь поддерживать уровень сахара в крови стабильным.
                </li>
              </ul>
            </li>
            <li>
              Избегайте сильных возбудителей
              <ul class="px-5">
                <li>
                  Если вы замечаете, что некоторые ситуации или вещи усиливают
                  ваши симптомы, старайтесь избегать их или научитесь
                  справляться c ними.
                </li>
                <li>
                  Обратите внимание на факторы, которые усиливают ваши симптомы.
                  Это могут быть физические нагрузки, эмоциональные стрессоры
                  или пищевые продукты, вызывающие негативную реакцию.
                </li>
                <li>
                  Если определенные ситуации или люди вызывают у вас дискомфорт,
                  старайтесь устанавливать границы и находить способы
                  справляться с ними, например, учиться эффективно
                  коммуницировать или использовать техники управления стрессом.
                </li>
              </ul>
            </li>
            <li>
              Регулярные консультации с врачом
              <ul class="px-5">
                <li>
                  Важно получить профессиональную медицинскую помощь и советы от
                  врача. Он может рекомендовать дополнительные методы лечения,
                  такие как психотерапия или прописание лекарственных
                  препаратов, в зависимости от вашего конкретного случая.
                </li>
                <li>
                  Следуйте рекомендациям врача и регулярно обновляйте свои
                  визиты, чтобы следить за прогрессом и вносить необходимые
                  изменения в лечебный план.
                </li>
              </ul>
            </li>
          </ol>
        </v-card-text>
      </v-card>
    </v-container>
    <hr />
    <NotificationsInfoComponents />
  </div>
</template>

<script>
import NotificationsInfoComponents from "../components/NotificationsInfoComponents.vue";
export default {
  components: { NotificationsInfoComponents },
};
</script>

<style type="text/css">
.bgimg {
  background-image: url("../assets/bg_home.png");
  background-repeat: repeat;
}
</style>
