<template>
  <v-container class="my-8">
    <v-row justify="space-between">
      <v-col cols="12" md="5">
        <NotificationsComponents />
      </v-col>
      <v-col cols="12" md="6">
        <v-card flat class="py-6 px-6" variant="outlined">
          <v-card-item>
            <h3 class="text-center">Зачем нужны напоминания</h3></v-card-item
          >
          <v-card-text class="my-5 text-justify">
            <p>
              Напоминания, которые наш чат-бот будет отправлять, имеют важное
              значение в поддержке пользователя и помогут ему выполнять
              необходимые рекомендации для борьбы с вегето-сосудистой дистонией
              (ВСД). Вот несколько причин, почему напоминания являются
              полезными:
            </p>
            <ol>
              <li>
                <b>Поддержка формирования привычек</b>: Напоминания помогут
                создать новые здоровые привычки, например, в питании, физической
                активности и управлении стрессом.
              </li>
              <li class="mt-3">
                <b>Поддержка соблюдения режима</b>: Напоминания поддержат
                соблюдение расписания, включая время приема пищи, физические
                упражнения, расслабляющие практики и отдых.
              </li>
              <li class="mt-3">
                <b>Повышение осведомленности</b>: Напоминания предоставят
                полезные советы и информацию о преимуществах рекомендаций,
                помогая лучше понять их важность для улучшения ВСД.
              </li>
              <li class="mt-3">
                <b>Поддержка мотивации</b>: Напоминания будут поддерживать и
                вдохновлять пользователей, предоставляя позитивные сообщения и
                поддержку на пути к достижению целей.
              </li>
              <li class="mt-3">
                <b>Укрепление результатов</b>: Напоминания помогут интегрировать
                новые привычки в повседневную жизнь, что приведет к снижению
                симптомов ВСД и повышению качества жизни.
              </li>
            </ol>
          </v-card-text>
        </v-card>
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
import NotificationsComponents from "../components/NotificationsComponents.vue";
export default {
  components: { NotificationsComponents },
};
</script>
